{
    "basics": {
        "name": "John Teske",
        "label": "Front-end Developer and Composer",
        "picture": "http://www.johnteskemusic.com/images/teske-600p-sq.jpg",
        "email": "john.teske@gmail.com",
        "phone": "",
        "website": "",
        "summary": "HTML Email and Front End Developer",
        "location": {
            "address": "",
            "postalCode": "",
            "city": "Seattle",
            "countryCode": "US",
            "region": "Washington"
        },
    "profiles": [
            {
                "network": "GitHub",
                "username": "johnteske",
                "url": "https://github.com/johnteske"
            },
            {
                "network": "LinkedIn",
                "username": "johndteske",
                "url": "https://www.linkedin.com/in/johndteske"
            }
        ]
    },
    "work": [
        {
            "company": "Schema Design",
            "position": "Software Engineer I",
            "startDate": "2017-03-01",
            "summary": "Design and develop web applications, websites, and prototypes with a focus on interactive data visualization. Develop primarily using the MEAN stack (Mongo, Angular, Express, Node) for platform and client work. Use tools, libraries, and other frameworks such as D3, Less, Jest, Vue, Webpack, and jQuery. Practice test-driven development, writing unit and integration tests as part of new features. Contribute to the development team on software platform work and larger client projects. Lead smaller client projects, sometimes as sole developer. Collaborate with designers to create modular components and scalable systems. Communicate with clients to create solutions for enterprise and public-facing applications."
        },
        {
            "company": "Schema Design",
            "position": "Contract Software Engineer",
            "startDate": "2016-12-01",
            "endDate": "2017-02-28"
        },
        {
            "company": "Self-Employed",
            "position": "Freelance Web Developer",
            "startDate": "2015-01-01"
        },
        {
            "company": "John Teske Music",
            "position": "Composer",
            "website": "http://fryemuseum.org",
            "startDate": "2003-09-01",
            "summary": "Compose and produce music with an emphasis on listener experience and environment. Design digital and print media, including flyers, handbills, social media content, and websites. Document and edit audio, photos, and video. Develop custom software tools and interfaces for composition, music production and research."
        },
        {
            "company": "Frye Art Museum",
            "position": "Digital Media Manager",
            "website": "http://fryemuseum.org",
            "startDate": "2015-02-09",
            "endDate": "2017-01-31",
            "summary": "Designed, developed, and implemented new features for the main website and microsites using HTML, CSS, PHP, and JavaScript. Maintained website and exhibition microsites built on ExpressionEngine, Wordpress, and Tumblr. Managed major web development projects with contract developers. Designed and developed HTML email marketing campaigns. Refined workflow and added consistency to code, design, and content through custom templates, task runners, and version control. Created digital signage systems and content to display exhibition, program, and membership information to museum visitors. Edited and published content to website, microsites, and media sites such as YouTube, SoundCloud, and Vimeo. Monitored website and email analytics and made strategic recommendations based on data."
        },
        {
            "company": "Frye Art Museum",
            "position": "Facilities Associate",
            "website": "http://fryemuseum.org",
            "startDate": "2013-06-01",
            "endDate": "2015-02-08",
            "summary": "Coproduced high quality cultural experiences with presenters and museum staff as lead event technician. Managed contract event technicians and advised exhibitions department on audio design for gallery shows. Optimized and enhanced presentation and audience experience through content formatting and customer service. Performed regular gallery maintenance as Facilities Associate."
        },
        {
            "company": "Montlake Bicycle Shop",
            "position": "Mechanic",
            "website": "https://montlakebike.com/",
            "startDate": "2011-05-01",
            "endDate": "2013-05-01",
            "summary": "Developed personalized solutions for customers, from budget repair and maintenance to building new bikes with custom part kits. Designed and built storage and display solutions after remodel, advised on website and visual design overhaul."
        },
        {
            "company": "Frye Art Museum",
            "position": "Contract Event Technician",
            "website": "http://fryemuseum.org",
            "startDate": "2009-08-01",
            "endDate": "2013-05-31",
            "summary": "Facilitated the production of events including concerts, lectures, and film screenings. Operated audio/visual equipment, designed and hung custom lighting for museum opening events."
        },
        {
            "company": "Gregg's Greenlake Cycles",
            "position": "Mechanic",
            "website": "",
            "startDate": "2009-05-01",
            "endDate": "2011-03-31",
            "summary": "Assisted in the development of a more efficient customer service and billing structure, in addition to regular service tasks."
        },
        {
            "company": "Seattle Chamber Music Society",
            "position": "Education and Operations Manager",
            "website": "",
            "startDate": "2008-02-01",
            "endDate": "2009-06-30",
            "summary": "Developed and coordinated education and outreach programs, managed administrative and concert operations, designed digital and print materials, optimized website design, provided in-office IT support."
        },
        {
            "company": "Gregg's Greenlake Cycles",
            "position": "Mechanic",
            "website": "",
            "startDate": "2006-08-01",
            "endDate": "2008-04-30",
            "summary": ""
        },
        {
            "company": "University of Washington School of Art",
            "position": "Media Assistant",
            "website": "",
            "startDate": "2004-02-01",
            "endDate": "2006-08-30",
            "summary": ""
        },
    ],
    "education": [
        {
            "institution": "University of Washington",
            "area": "Music in Composition",
            "studyType": "Bachelor",
            "startDate": "2003-09-01",
            "endDate": "2007-06-01",
            "summary": "Scanned and digitally archived film slides, retouched images in Photoshop, kept detailed records of alterations, uploaded files on custom webpages for student and faculty access. Worked closely with supervisor to create more efficient systems as digital archiving increased."
        }
    ],
    "skills": [
        {
            "name": "Web Development",
            "level": "",
            "keywords": [
                "HTML",
                "CSS",
                "JavaScript",
                "Vue",
                "Angular",
                "D3",
                "Sass",
                "Less",
                "PHP",
                "HTML Email"
            ]
        },
        {
            "name": "CMS and Workflow",
            "level": "",
            "keywords": [
                "Git",
                "Gulp",
                "Grunt",
                "Wordpress",
                "ExpressionEngine",
                "Liquid",
                "Tumblr"
            ]
        },
        {
            "name": "Software and Web apps",
            "level": "",
            "keywords": [
                "Adobe Creative Cloud",
                "Final Cut Pro",
                "Microsoft Office"
            ]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        }
    ]
}
